Repository: barisbulutdemir/batchreports
Catalog: Resources/Strings.*.resx
Languages: tr_tr

# MainWindow.Title
source: Production Tracking System
tr_tr: Üretim Takip Sistemi

# MainWindow.ShiftManagement
source: Shift Management
tr_tr: Vardiya Yönetimi

# MainWindow.ProductionInfo
source: Production Information
tr_tr: Üretim Bilgileri

# MainWindow.StartShift
source: Start Shift
tr_tr: Vardiyayı Başlat

# MainWindow.EndShift
source: End Shift
tr_tr: Vardiyayı Bitir

# MainWindow.ShiftHistory
source: Shift History
tr_tr: Vardiya Geçmişi

# MainWindow.PlcTest
source: ðŸ”§ PLC Test Page
tr_tr: 🔧 PLC Test Sayfası

# MainWindow.TotalProduction
source: Total Production
tr_tr: Toplam Üretim

# MainWindow.Logs
source: Logs
tr_tr: Loglar

# MainWindow.DailyPalletProduction
source: Daily Pallet Production
tr_tr: Günlük Palet Üretimi

# MainWindow.ShiftStart
source: Shift Start
tr_tr: Vardiya Başlangıç

# MainWindow.ProductionStart
source: Production Start
tr_tr: Üretim Başlangıç

# MainWindow.NotStarted
source: Not Started
tr_tr: Başlatılmadı

# MainWindow.Pallet
source: pallet
tr_tr: palet

# MainWindow.Add
source: Add
tr_tr: Ekle

# MainWindow.Delete
source: Delete
tr_tr: Sil

# MainWindow.PlcStatus
source: PLC: Checking Connection...
tr_tr: PLC: Bağlantı Kontrol Ediliyor...

# MainWindow.PlcConnected
source: PLC: Connected
tr_tr: PLC: Bağlı

# MainWindow.PlcDisconnected
source: PLC: Disconnected
tr_tr: PLC: Bağlantı Yok

# MainWindow.PlcError
source: PLC: Error
tr_tr: PLC: Hata

# Language.Turkish
source: TÃ¼rkÃ§e
tr_tr: Türkçe

# Language.SelectLanguage
source: Language Selection
tr_tr: Dil Seçimi

# Message.SelectOperator
source: Please select an operator!
tr_tr: Lütfen operatör seçiniz!

# Message.EndShiftConfirm
source: Are you sure you want to end the shift?
tr_tr: Vardiyayı bitirmek istediğinizden emin misiniz?

# Message.ShiftEnded
source: End Shift
tr_tr: Vardiya Bitir

# Message.Warning
source: Warning
tr_tr: Uyarı

# Message.Error
source: Error
tr_tr: Hata

# Message.Question
source: Question
tr_tr: Soru

# PlcTest.Title
source: PLC Test Page
tr_tr: PLC Test Sayfası

# PlcTest.IpAddress
source: PLC IP Address:
tr_tr: PLC IP Adresi:

# PlcTest.RegisterAddress
source: Register Address:
tr_tr: Register Adresi:

# PlcTest.WordCount
source: Word Count:
tr_tr: Kelime Sayısı:

# PlcTest.TestButton
source: Test PLC
tr_tr: PLC Test Et

# PlcTest.Close
source: Close
tr_tr: Kapat

# PlcTest.Result
source: Result:
tr_tr: Sonuç:

# PlcTest.Status
source: Status:
tr_tr: Durum:

# PlcTest.Testing
source: Testing...
tr_tr: Test ediliyor...

# PlcTest.Success
source: Success
tr_tr: Başarılı

# PlcTest.Failed
source: Failed
tr_tr: Başarısız

# ShiftHistory.Title
source: Shift History
tr_tr: Vardiya Geçmişi

# ShiftHistory.Close
source: Close
tr_tr: Kapat

# ShiftHistory.NoRecords
source: No shift records found yet.
tr_tr: Henüz vardiya kaydı bulunamadı.

# ShiftHistory.RecordsShowing
source: records showing
tr_tr: kayıt gösteriliyor

# ShiftHistory.TotalProduction
source: Total Production:
tr_tr: Toplam Üretim:

# ShiftHistory.ShiftDuration
source: Shift Duration:
tr_tr: Vardiya Süresi:

# ShiftHistory.ProductionDuration
source: Production Duration:
tr_tr: Üretim Süresi:

# ShiftHistory.Operator
source: Operator:
tr_tr: Operatör:

# ShiftHistory.StartTime
source: Start:
tr_tr: Başlangıç:

# MainWindow.InitializeComponentCompleted
source: InitializeComponent completed
tr_tr: InitializeComponent tamamlandı

# MainWindow.InitializeDatabaseCompleted
source: InitializeDatabase completed
tr_tr: InitializeDatabase tamamlandı

# MainWindow.DatabaseCheckCompleted
source: Database tables check completed
tr_tr: Veritabanı tabloları kontrol tamamlandı

# MainWindow.InitializeServicesCompleted
source: InitializeServices completed
tr_tr: InitializeServices tamamlandı

# MainWindow.InitializeTimerCompleted
source: InitializeTimer completed
tr_tr: InitializeTimer tamamlandı

# MainWindow.RecoverOpenBatchesTriggered
source: RecoverOpenBatchesAsync triggered
tr_tr: RecoverOpenBatchesAsync tetiklendi

# MainWindow.LoadInitialDataCompleted
source: LoadInitialData completed
tr_tr: LoadInitialData tamamlandı

# MainWindow.InitializeLocalizationCompleted
source: InitializeLocalization completed
tr_tr: InitializeLocalization tamamlandı

# MainWindow.ConstructorCompleted
source: MainWindow constructor completed successfully
tr_tr: MainWindow constructor başarıyla tamamlandı

source: MainWindow constructor error
tr_tr: MainWindow constructor hatası

# MainWindow.LogCleared
source: Log cleared
tr_tr: Log temizlendi

# SettingsWindow.DataLoadError
source: Data loading error: {0}
tr_tr: Veri yükleme hatası: {0}

# SettingsWindow.OperatorListLoadError
source: Operator list loading error: {0}
tr_tr: Operatör listesi yükleme hatası: {0}

# SettingsWindow.OperatorAddedSuccessfully
source: Operator '{0}' added successfully!
tr_tr: '{0}' operatörü başarıyla eklendi!

# SettingsWindow.OperatorAddError
source: Operator addition error: {0}
tr_tr: Operatör ekleme hatası: {0}

# SettingsWindow.PleaseSelectOperatorToDelete
source: Please select an operator to delete!
tr_tr: Lütfen silinecek operatörü seçin!

# SettingsWindow.OperatorDeleteConfirmation
source: Operator Deletion Confirmation
tr_tr: Operatör Silme Onayı

# SettingsWindow.OperatorDeletedSuccessfully
source: Operator '{0}' deleted successfully!
tr_tr: '{0}' operatörü başarıyla silindi!

# SettingsWindow.OperatorDeleteError
source: Operator deletion error: {0}
tr_tr: Operatör silme hatası: {0}

# SettingsWindow.ErrorOccurred
source: Error occurred
tr_tr: Hata oluştu

# SettingsWindow.InvalidIpAddress
source: Invalid IP address
tr_tr: Geçersiz IP adresi

# SettingsWindow.InvalidPort
source: Invalid port
tr_tr: Geçersiz port

# SettingsWindow.InvalidRegisterAddress
source: Invalid register address
tr_tr: Geçersiz register adresi

# SettingsWindow.InvalidWordCount
source: Invalid word count
tr_tr: Geçersiz word sayısı

# SettingsWindow.TestSuccessful
source: Test successful
tr_tr: Test başarılı

# SettingsWindow.TestFailed
source: Test failed
tr_tr: Test başarısız

# SettingsWindow.ReadyForTest
source: Ready - Enter information for test
tr_tr: Hazır - Test için bilgileri girin

# SettingsWindow.Confirmation
source: Confirmation
tr_tr: Onay

# SettingsWindow.HistoryCleared
source: History Cleared
tr_tr: Geçmiş Temizlendi

# SettingsWindow.HistoryClearError
source: History clearing error: {0}
tr_tr: Geçmiş temizleme hatası: {0}

# SettingsWindow.PlcSettingsLoadError
source: PLC settings loading error: {0}
tr_tr: PLC ayarları yükleme hatası: {0}

# SettingsWindow.PlcSettingsSavedSuccessfully
source: PLC settings saved successfully!
tr_tr: PLC ayarları başarıyla kaydedildi!

# SettingsWindow.PlcSettingsSaveError
source: PLC settings save error: {0}
tr_tr: PLC ayarları kaydetme hatası: {0}

# SettingsWindow.MaterialNamesLoadError
source: Material names loading error: {0}
tr_tr: Malzeme isimleri yükleme hatası: {0}

# SettingsWindow.MaterialNamesSavedSuccessfully
source: Material names saved successfully!
tr_tr: Malzeme isimleri başarıyla kaydedildi!

# SettingsWindow.MaterialNamesSaveError
source: Material names save error: {0}
tr_tr: Malzeme isimleri kaydetme hatası: {0}

# SettingsWindow.TimeZoneSettingsLoadError
source: Time zone settings loading error: {0}
tr_tr: Saat dilimi ayarları yükleme hatası: {0}

# SettingsWindow.DaylightSavingTime
source: Daylight saving time: {0}
tr_tr: Yaz saati uygulaması: {0}

# SettingsWindow.Yes
source: Yes
tr_tr: Evet

# SettingsWindow.No
source: No
tr_tr: Hayır

# UnifiedBatchTrackingWindow.CriticalError
source: Critical Error
tr_tr: Kritik Hata

# UnifiedBatchTrackingWindow.Error
source: Error
tr_tr: Hata

# UnifiedBatchTrackingWindow.Status.Completed
source: Completed
tr_tr: Tamamlandı

# UnifiedBatchTrackingWindow.M1BatchDeleteConfirmation
source: Delete M1 Batch ID {0}?
tr_tr: M1 Batch ID {0} silinsin mi?

# UnifiedBatchTrackingWindow.BatchDelete
source: Batch Delete
tr_tr: Batch Silme

# UnifiedBatchTrackingWindow.M1BatchDeletedSuccessfully
source: M1 Batch deleted successfully.
tr_tr: M1 Batch başarıyla silindi.

# UnifiedBatchTrackingWindow.Successful
source: Successful
tr_tr: Başarılı

# UnifiedBatchTrackingWindow.BatchNotFound
source: Batch not found. It may have been already deleted.
tr_tr: Batch bulunamadı. Zaten silinmiş olabilir.

# UnifiedBatchTrackingWindow.Warning
source: Warning
tr_tr: Uyarı

# UnifiedBatchTrackingWindow.M1BatchDeleteError
source: M1 Batch delete error:\n{0}
tr_tr: M1 Batch silme hatası:\n{0}

# UnifiedBatchTrackingWindow.PleaseSelectM1BatchToDelete
source: Please select M1 batch to delete.
tr_tr: Lütfen silinecek M1 batch'i seçin.

# UnifiedBatchTrackingWindow.M2BatchDeleteConfirmation
source: Delete M2 Batch ID {0}?
tr_tr: M2 Batch ID {0} silinsin mi?

# UnifiedBatchTrackingWindow.M2BatchDeletedSuccessfully
source: M2 Batch deleted successfully.
tr_tr: M2 Batch başarıyla silindi.

# UnifiedBatchTrackingWindow.M2BatchDeleteError
source: M2 Batch delete error:\n{0}
tr_tr: M2 Batch silme hatası:\n{0}

# UnifiedBatchTrackingWindow.PleaseSelectM2BatchToDelete
source: Please select M2 batch to delete.
tr_tr: Lütfen silinecek M2 batch'i seçin.

# UnifiedBatchTrackingWindow.Status.Ready
source: Ready
tr_tr: Harç Hazır

# UnifiedBatchTrackingWindow.NoCompletedM1BatchesToDelete
source: No completed M1 batches found to delete.
tr_tr: Silinecek tamamlanmış M1 batch bulunamadı.

# UnifiedBatchTrackingWindow.Information
source: Information
tr_tr: Bilgi

# UnifiedBatchTrackingWindow.BulkDelete
source: Bulk Delete
tr_tr: Toplu Silme

# UnifiedBatchTrackingWindow.M1BatchesDeletedSuccessfully
source: {0} M1 batches deleted successfully.
tr_tr: {0} adet M1 batch başarıyla silindi.

# UnifiedBatchTrackingWindow.BulkDeleteError
source: Bulk delete error:\n{0}
tr_tr: Toplu silme hatası:\n{0}

# UnifiedBatchTrackingWindow.NoCompletedM2BatchesToDelete
source: No completed M2 batches found to delete.
tr_tr: Silinecek tamamlanmış M2 batch bulunamadı.

# UnifiedBatchTrackingWindow.M2BatchesDeletedSuccessfully
source: {0} M2 batches deleted successfully.
tr_tr: {0} adet M2 batch başarıyla silindi.

# ReportsWindow.StartupError
source: ReportsWindow startup error: {0}
tr_tr: ReportsWindow başlatma hatası: {0}

# ReportsWindow.LoadError
source: ReportsWindow loading error: {0}
tr_tr: ReportsWindow yükleme hatası: {0}

# ReportsWindow.Aggregate
source: Aggregate: {0} kg
tr_tr: Agrega: {0} kg

# ReportsWindow.TotalWater
source: Total Water: {0:0.0} kg
tr_tr: Toplam Su: {0:0.0} kg

# ReportsWindow.PigmentTotal
source: Pigment Total: {0:0.0} kg
tr_tr: Pigment Toplam: {0:0.0} kg

# ReportsWindow.TotalBatch
source: Total Batch
tr_tr: Toplam Batch

# ReportsWindow.Cement
source: Cement
tr_tr: Çimento

# ReportsWindow.AggregateTotal
source: Aggregate (Total)
tr_tr: Agrega (Toplam)

# ReportsWindow.PigmentTotalLabel
source: Pigment (Total)
tr_tr: Pigment (Toplam)

# ReportsWindow.TotalWaterLabel
source: Total Water
tr_tr: Toplam Su

# ReportsWindow.AverageMoisture
source: Average Moisture
tr_tr: Nem Ortalama

# ReportsWindow.PigmentTotalName
source: Pigment Total
tr_tr: Pigment Toplam

# ReportsWindow.Mixer1DataLoaded
source: Mixer1 data loaded: {0} batches
tr_tr: Mixer1 veriler yüklendi: {0} batch

# ReportsWindow.Mixer1ReportLoadError
source: Error loading Mixer1 reports:\n{0}
tr_tr: Mixer1 raporları yüklenirken hata oluştu:\n{0}

# ReportsWindow.Mixer2DataLoaded
source: Mixer2 data loaded: {0} batches
tr_tr: Mixer2 verileri yüklendi: {0} batch

# ReportsWindow.Mixer2ReportLoadError
source: Error loading Mixer2 reports:\n{0}
tr_tr: Mixer2 raporları yüklenirken hata oluştu:\n{0}

# ReportsWindow.DeleteAllHistoryConfirmation
source: All historical batch data (Mixer1+Mixer2) will be deleted. Are you sure?
tr_tr: Tüm geçmiş batch verileri (Mixer1+Mixer2) silinecek. Emin misiniz?

# ReportsWindow.AllHistoryDeleted
source: All historical data deleted
tr_tr: Tüm geçmiş veriler silindi

# ReportsWindow.DesktopFolderNotFound
source: Desktop folder not found
tr_tr: Desktop klasörü bulunamadı

# Common.Error
source: Error
tr_tr: Hata

# Common.Warning
source: Warning
tr_tr: Uyarı

# Common.Successful
source: Successful
tr_tr: Başarılı

# Common.Information
source: Information
tr_tr: Bilgi

# SettingsWindow.OperatorDeleteConfirmationText
source: Are you sure you want to delete the operator '{0}'?\n\nThis action cannot be undone!
tr_tr: '{0}' adlı operatörü silmek istediğinizden emin misiniz?\n\nBu işlem geri alınamaz!

# SettingsWindow.TimeZoneTestError
source: Time zone test error: {0}
tr_tr: Saat dilimi test hatası: {0}

# SettingsWindow.TimeZoneSettingsSavedSuccessfully
source: Time zone settings saved successfully!\n\nSelected Time Zone: {0}\nAuto Conversion: {1}
tr_tr: Saat dilimi ayarları başarıyla kaydedildi!\n\nSeçilen Saat Dilimi: {0}\nOtomatik Dönüşüm: {1}

# SettingsWindow.PleaseSelectTimeZone
source: Please select a time zone!
tr_tr: Lütfen bir saat dilimi seçin!

# SettingsWindow.TimeZoneSettingsSaveError
source: Time zone settings save error: {0}
tr_tr: Saat dilimi ayarları kaydetme hatası: {0}

# SettingsWindow.Active
source: Active
tr_tr: Aktif

# UnifiedBatchTrackingWindow.StartupError
source: UnifiedBatchTrackingWindow startup error:\n{0}\n\nStack Trace:\n{1}
tr_tr: UnifiedBatchTrackingWindow başlatma hatası:\n{0}\n\nStack Trace:\n{1}

# UnifiedBatchTrackingWindow.LastRefresh
source: Last refresh: {0}
tr_tr: Son yenileme: {0}

# UnifiedBatchTrackingWindow.Loading
source: Loading...
tr_tr: Yükleniyor...

# UnifiedBatchTrackingWindow.M1DataLoadError
source: Error loading M1 batch data:\n{0}
tr_tr: M1 batch verileri yüklenirken hata oluştu:\n{0}

# UnifiedBatchTrackingWindow.M2DataLoadError
source: Error loading M2 batch data:\n{0}
tr_tr: M2 batch verileri yüklenirken hata oluştu:\n{0}

# UnifiedBatchTrackingWindow.DeleteAllM1Confirmation
source: {0} completed M1 batches will be deleted. Are you sure?
tr_tr: {0} adet tamamlanmış M1 batch silinecek. Emin misiniz?

# ReportsWindow.LoadDataFirst
source: Load Mixer1 or Mixer2 data first
tr_tr: Önce Mixer1 veya Mixer2 verilerini getirin

# ReportsWindow.LoadDataFirstMessage
source: You need to load Mixer1 or Mixer2 data before creating PDF report.
tr_tr: PDF raporu oluşturmadan önce Mixer1 veya Mixer2 verilerini getirmeniz gerekiyor.

# ReportsWindow.DataReadError
source: Data read error:\n{0}
tr_tr: Veri okuma hatası:\n{0}

# ReportsWindow.DataError
source: Data Error
tr_tr: Veri Hatası

# ReportsWindow.Information
source: Information
tr_tr: Bilgi

# ReportsWindow.Value
source: Value
tr_tr: Değer

# ReportsWindow.CementType
source: Cement Type
tr_tr: Çimento Tipi

# ReportsWindow.Unknown
source: Unknown
tr_tr: Bilinmiyor

# ReportsWindow.AggregateType
source: Aggregate Type
tr_tr: Agrega Tipi

# ReportsWindow.AdmixtureType
source: Admixture Type
tr_tr: Katkı Tipi

# ReportsWindow.PigmentType
source: Pigment Type
tr_tr: Boya Tipi

# ConcreteBatchDetailWindow.LoadcellWater
source: Loadcell Water
tr_tr: Loadcell Su

# ConcreteBatchDetailWindow.PulseWater
source: Pulse Water
tr_tr: Puls Su

# ConcreteBatchDetailWindow.TotalWater
source: Total Water
tr_tr: Toplam Su

# ConcreteBatchDetailWindow.Moisture
source: Moisture
tr_tr: Nem

# ConcreteSimulation.Mixer1BatchError
source: Mixer1 Batch Error
tr_tr: Mixer1 Batch Hatası

# ConcreteSimulation.AggregateAliases
source: Aggregate aliases
tr_tr: Agrega alias'ları

# ConcreteSimulation.AdmixtureAliases
source: Admixture aliases
tr_tr: Katkı alias'ları

# ConcreteSimulation.Mixer1BatchSaved
source: Mixer1 batch saved successfully
tr_tr: Mixer1 batch başarıyla kaydedildi

# ConcreteSimulation.Mixer1BatchSaveError
source: Mixer1 batch save error
tr_tr: Mixer1 batch kaydetme hatası

# ConcreteSimulation.BatchLoadedWithCements
source: Batch loaded with cement collection. Cement count
tr_tr: Batch çimento koleksiyonu ile yüklendi. Çimento sayısı

# ConcreteSimulation.Cement
source: Cement
tr_tr: Çimento

# ConcreteSimulation.BatchReloadFailed
source: Batch reload failed
tr_tr: Batch yeniden yüklenemedi

# ConcreteSimulation.CementConsumptionSaveError
source: Cement consumption save error
tr_tr: Çimento tüketimi kaydetme hatası

# Mixer2StatusBasedProcessor.ProcessingError
source: Mixer2 processing error
tr_tr: Mixer2 işleme hatası

# Mixer2StatusBasedProcessor.HorizontalBucketNewBatch
source: Horizontal bucket - New batch created. Status: In Horizontal Bucket
tr_tr: Yatay kova - Yeni batch oluşturuldu. Status: Yatay Kovada

# Mixer2StatusBasedProcessor.VerticalBucketMoved
source: Vertical bucket - Batches moved to vertical bucket. Status: In Vertical Bucket
tr_tr: Dikey kova - Batch'ler dikey kovaya taşındı. Status: Dikey Kovada

# Mixer2StatusBasedProcessor.WaitingBunkerMoved
source: Waiting bunker - Batches moved to waiting bunker. Status: In Waiting Bunker
tr_tr: Bekleme bunker - Batch'ler bekleme bunkerine taşındı. Status: Bekleme Bunkerinde

# ConcreteBatchDetailWindow.CementType
source: Cement
tr_tr: Çimento

# ConcreteBatchDetailWindow.CementPercent
source: Cement %
tr_tr: Çimento %

# SettingsWindow.ConnectingToPlc
source: Connecting to PLC...
tr_tr: PLC'ye bağlanılıyor...

# SettingsWindow.Details
source: Details
tr_tr: Detay

# SettingsWindow.PlcIpEmptyError
source: Error: PLC IP address cannot be empty!
tr_tr: Hata: PLC IP adresi boş olamaz!

# SettingsWindow.InvalidIpFormatError
source: Error: Invalid IP address format!
tr_tr: Hata: Geçersiz IP adresi formatı!

# SettingsWindow.InvalidPortError
source: Error: Invalid port number! (Must be between 1-65535)
tr_tr: Hata: Geçersiz port numarası! (1-65535 arası olmalı)

# SettingsWindow.InvalidRegisterError
source: Error: Invalid register address! (Must be between 0-65535)
tr_tr: Hata: Geçersiz register adresi! (0-65535 arası olmalı)

# SettingsWindow.InvalidWordCountError
source: Error: Invalid word count! (Must be between 1-100)
tr_tr: Hata: Geçersiz word sayısı! (1-100 arası olmalı)

# SettingsWindow.PlcTestStarting
source: PLC Test Starting...
tr_tr: PLC Test Başlatılıyor...

# SettingsWindow.PlcConnectionSuccessful
source: PLC connection successful!
tr_tr: PLC bağlantısı başarılı!

# SettingsWindow.TestCompleted
source: Test completed!
tr_tr: Test tamamlandı!

# SettingsWindow.PlcTestError
source: PLC Test Error
tr_tr: PLC Test Hatası

# Mixer2StatusBasedProcessor.MixerAggregateMoved
source: Mixer aggregate - Batches moved to mixer. Status: In Mixer
tr_tr: Mixer agrega - Batch'ler mixere taşındı. Status: Mixerde

# Mixer2StatusBasedProcessor.MixerCementSaved
source: Mixer cement - Cement data saved
tr_tr: Mixer çimento - Çimento verileri kaydedildi
